class Ozb_language:

    class start:
        client = "<b>TayyorTaxi | Qashqadaryo!</b> телеграм ботига хуш келибсиз!\n\n" \
                 "Бир икта клик орқали ҳайдовчини топиш учун <b>«🚖 Такси буюртмаси»</b> " \
                 "ва <b>«📦 Доставка»</b> тугмасини босинг!"

        greeting = "Xуш келибсиз!"

    class registration:
        name = "<b>Telegram Taxi | Haydovchi</b> ботига хуш келибсиз!\n\n" \
               "Ҳайдовчи бўлиш учун кичик рўйхатдан ўтиш ўтиш керак, ундан кейин сиз фаол бўлиб такси, " \
               "етказиб бериш ва юк  учун буюртмалар олишни бошлашингиз мумкин!\n\n" \
               "Бошлаш учун исмингизни киритинг 👇"
        model = "Автомобилингиз моделини танланг 👇"
        number = "<b>Автомобилнинг давлат рақамини келтирилган форматда киритинг:</b>\n\n" \
                 "01A123BC\n" \
                 "01123ABC\n" \
                 "01H123456\n\n" \
                 "<i>⚠ Маълумот ушбу хизматдан ташқари ҳеч " \
                 "қаерга узатилмайди ва фақат йўловчи билан " \
                 "учрашишни осонлаштириш учун керак</i>"
        color = "Автомобилингизнинг рангини танланг 👇"
        car_subtype = "Сизга мос келадиган тарифни танланг👇\n\n" \
                      "<b>🚐 Кичкина кузов:</b>\n" \
                      "<i>Labo, Муравейник, Волга, Жигули, Москвич (верхний багаж) ва хоказо</i>\n" \
                      "Вазн — 500 кг гача\nичига — 170 см\nэнига — 100 см\nтепага — 90 см\n\n" \
                      "<b>🚚 Ўртача кузов:</b>\n" \
                      "<i>Kia Bongo 3, Газель, УАЗ бортовой ва хоказо</i>\n" \
                      "Вазн — 1000 кг гача\nичига — 260 см\nэнига — 130 см\nтепага — 150 см\n\n" \
                      "<b>🚛 Катта кузов:</b>\n<i>Isuzu, ЗиЛ, Камаз ва хоказо</i>\n" \
                      "Вазн — 2000 кг гача\nичига — 380 см\nэнига — 180 см\nтепага — 180 см"
        phone = f'Клиентлар билан алоқа учун рақамингизни юборинг 👇\n\n' \
                f'Сиз <b>«Менинг рақамим»</b> тугмасини босишингиз ' \
                f'ёк рақамингизни шаблонга мувофиқ қўлда киритишингиз мумкин: +998 ** *** ** **'
        agreement = 'Ҳаммаси тоғрими? 👇\n\n<b>«✅Тўғри»</b> тугмасини босиш орқали сиз шартларни ' \
                    'ўқиб чиққанингиз ва розилигингизни тасдиқлайсиз  - '
        rules = "Сервис ҳақида"
        how_to_use = "Қандай фойдаланилади"

    class menu:
        class client:
            menu = "🏠 Бош саҳифа"
            taxi = "🚖 Такси буюртмаси"
            delivery = "📦 Доставка"
            truck = "🚚 Грузовой"
            order = "🗓 Фаол буюртмалар"
            phone = "📱 Рақамини ўзгартириш"
            tarif = "ℹ Тарифлар / Инфо"
            change = "🙋 Ҳайдовчи бўлиш"
            lang = "🇷🇺/🇺🇿"
            myPhone = "📱Менинг рақамим"

        class driver:
            menu = "🏠 Бош саҳифа"
            online = "🚕 Йўлдаман"
            offline = "⛔ Йўлдан чиқиш"
            activity = "⚡ Моя активность"
            wallet = "💳 Менинг ҳамёним"
            settings = "⚙ Сўзламалар"
            onSpot = "📍 Мен жойимдаман"
            orderData = "🗓 Буюртма маълумотлари"
            myPhone = "📱Менинг рақамим"
            lang = "🇷🇺/🇺🇿"

    class information:
        about_us = "ℹ Сервис ҳақида"
        language = "🇷🇺/🇺🇿"
        how_to_use = "❓ Қандай фойдаланилади"
        feedback = "☎ Алоқа"
        rules = "Сервис ҳақида"
        personalData = "✍ Менинг маълумотларим"

    class driver:
        bot = "Ҳайдовчи бўлиш учун ушбу 👉 @tthaydovchi_bot ботда рўйхатдан ўтинг\n\n" \
              "Рўйхатдан ўтганингиздан сўнг дарҳол мижозлар буюртмаларини қабул қилишни бошлашингиз мумкин."

    class symbol:
        sum = 'сум'

    class settings:
        rus = "🇷🇺 Ru"
        ozb = "🇺🇿 O’z"
        eng = "🇺🇸 Eng"
        language = [rus, ozb, eng]

    class url:

        class driver:
            about_us = "https://telegra.ph/Hizmat-k%D1%9Ersatish-shartlari-06-30"

    class feedback:
        feedback = "Биз билан қуйидаги контактлар орқали боғланишингиз мумкин👇\n\n" \
                   "Телеграм:  @tt_aloqabot"

    class about_us:
        about_us = "👉 Сервис ҳақида"

    class buttons:
        class client:
            class taxi:
                standard = "🚕 Стандарт"
                comfort = "🚙 Комфорт"
                location = "📍 Менинг манзилим"
                comment = "⏩ Комментария йўқ"
                cashbackPay = "💵 Кешбек орқали тўлаш"
                cashbackNotPay = "✅ Кешбексиз"

            class truck:
                small = "🚐 Кичкина кузов"
                medium = "🚚 Ўртача кузов"
                big = "🚛 Катта кузов"

        class driver:
            class onSpot:
                start = "🚙 Саёҳатни бошлаш"
                orderData = "🗓 Буюртма маълумотлари"
                waiting = "⏱ Кутиш"
                finish = "🏁 Саёҳатни тугатиш"
                letsGo = "🚙 Саёҳатни давом этиш"

            back = "⬅ Ортга"
            yes = "✅Ха"
            no = "❌Йўқ"
            accept = "➡Тасдиқлаш"
            accept2 = "✅ Қабул қилиш"
            reject = "❌Бекор қилиш"
            delivery = "Доставка"
            truck = "Грузовой"

        class wallet:
            balance = "➕ Балансни тўлдириш"

            payme = "Payme"
            click = "Click"
            paynet = "Paynet"
            pay = "✅ Тўлаш"

        class personal_cabinet:
            data = "✍Менинг маълумотларим"
            truck = "🚚 Грузовой"
            name = "Исмни ўзгартириш"
            phone = "Рақамини ўзгартириш"
            car = "Машинани ўзгартириш"
            model = "Моделни ўзгартириш"
            number = "Давлат номерини ўзгартириш"
            color = "Рангини ўзгартириш"

        class active_order:
            location = "📍 Менинг манзилим"
            cancel = "❌ Бекор қилиш"
            delete = "❌ Барибир бекор қилиш"

    class personal_cabinet:
        name = "Исм"
        phone = "Рақамингиз"
        car = "Машина"
        id = "ID"
        wallet = "Баланс"
        common = "Асосий"
        bonus = "Бонус"
        congratulation = "Табриклаймиз! Хизматда рўйхатдан ўтганингиз учун сизга 💵 <b>50 000</b>  бонус тақдим этилди!\n\n" \
                         "Биринчидан танишиб чиқинг  👇"
        online = "❕<i>Хизмат комиссияси бажарилган буюртма нархининг 10%, камида 1000 сўм</i>\n\n" \
                 "<i>Клиентлар буюртмаларини қабул қилишни бошлаш учун, <b>«🚕 Йўлдаман»</b></i> тугмасини босинг 👇"
        new_data = "Янги маълумотларни киритинг 👇"
        new_data_rec = "Маълумотларни ўзгартирилди."

    class wallet:
        payment = "Тўлдириш миқдорини белгиланг 👇"
        pay_way = "Тўлов усулини танланг 👇"
        amount = "Тўлдириш миқдори"
        pay_way2 = "Тўлов орқали"
        amount2 = "Тўлов миқдори"
        payment2 = '<i>Тўловни амалга ошириш учун</i> <b>«✅✅ Тўлаш»</b> тугмаси босинг👇'
        accept = '✅Тўлов тасдиқланди'

    class tarif:

        class client:
            standard = "🚖 Такси — Стандарт\n" \
                       "<i>Matiz, Nexia 1, Nexia 2, Nexia 3, Spark</i>\n" \
                       "5.000 сўм дан\n\n" \
                       "💵 5.000 сўм биринчи 500 метр учун\n" \
                       "⏱ Бепул кутиш 3 дақиқа\n\n" \
                       "💵 Кейин 2.000 сўм 1 км га\n" \
                       "⏱ Кутиш 500 сўм 1 дақиқаг"

            comfort = "🚖 Такси — Комфорт\n" \
                      "<i>Cobalt, Gentra, Lacetti, Epica, Malibu, Captiva</i>\n" \
                      "7.000 сўм дан\n\n" \
                      "💵 7.000 сўм биринчи 500 метр учун\n" \
                      "⏱ Бепул кутиш 5 дақиқа\n\n" \
                      "💵 Кейин 2.500 сўм 1 км га\n" \
                      "⏱ Кутиш 700 сўм 1 дақиқага"

            delivery = "📦 Доставка\n" \
                       "5.000 сўм дан\n\n" \
                       "💵 5.000 сўм биринчи 500 метр учун\n\n" \
                       "⏱ Бепул кутиш 3 дақиқа\n" \
                       "💵 Кейин 2.000 сўм 1 км га"

            small = "🚚 Грузовой — <b>🚐 Кичкина кузов</b>\n" \
                    "10 000 сўм дан\n" \
                    "<i>Labo, Муравейник, Волга, Жигули, Москвич (верхний багаж) ва хоказо </i>\n" \
                    "Вазн — 500 кг гача\n" \
                    "ичига — 170 см\n" \
                    "энига — 100 см\n" \
                    "тепага — 90 см\n\n" \
                    "💵 10 000 сўм биринчи 1 км учун\n" \
                    "⏱ Бепул кутиш 15 дақиқа\n\n" \
                    "💵 Кейин 5 000 сўм 1 км га\n" \
                    "⏱ Кутиш 1 000 сўм 1 дақиқага"

            medium = "🚚 Грузовой — <b>🚐 Ўртача кузов</b>\n" \
                    "от 12 000 сум\n" \
                    "<i>Kia Bongo 3, Газель, УАЗ бортовой ва хоказо</i>\n" \
                    "Вазн — 1000 кг гача\n" \
                    "ичига — 260 см\n" \
                    "энига — 130 см\n" \
                    "тепага — 150 см\n\n" \
                    "💵 12 000 сўм биринчи 1 км учун\n" \
                    "⏱ Бепул кутиш 15 дақиқа\n\n" \
                    "💵 Кейин 6 000 сўм 1 км га\n" \
                    "⏱ Кутиш 1 000 сўм 1 дақиқага"

            big = "🚚 Грузовой — <b>🚐 Катта кузов</b>\n" \
                    "от 15 000 сум\n" \
                    "<i>Isuzu, ЗиЛ, Камаз ва хоказо</i>\n" \
                    "Вазн — 2000 кг гача\n" \
                    "ичига — 380 см\n" \
                    "энига — 180 см\n" \
                    "тепага — 180 см\n\n" \
                    "💵 15 000 сўм биринчи 1 км учун\n" \
                    "⏱ Бепул кутиш 15 дақиқа\n\n" \
                    "💵 Кейин 7 000 сўм 1 км га\n" \
                    "⏱ Кутиш 1 000 сўм 1 дақиқага"

            tarif_dict = {1: standard, 2: comfort, 3: delivery, 4: small, 5: medium, 6: big}

        class driver:
            spots = "Буюртма олишни истаган питакларни танланг👇\n<i>Бир нечтасини танлашингиз мумкин</i>"

    class phone:
        class client:
            number = "Сизнинг рақамингиз"
            share_phone = "Агар ўзгартирмоқчи бўлсангиз, янги рақам юборинг 👇\n\n" \
                          "Сиз <b>«Менинг рақамим»</b> тугмасини босишингиз ёк рақамингизни " \
                          "шаблонга мувофиқ қўлда киритишингиз мумкин: +998** *** ** **"

    class online:
        accept = "✅ Сиз фаол бўлдингиз! Клиентлар чиқиши билан сиз хабарнома оласиз.\n\n" \
                 "<i>Клиентлар учун фаолликни тўхтатиш ёки питакларни ўзгартириш учун " \
                 "<b>«⛔ Йўлдан чиқиш»</b> тугмасини босинг</i>"

    class offline:
        reject = "⛔ Сиз йўлдан чиқтингиз ва энди клиентлардан буюртма олмайсиз\n\n" \
                 "<i>Клиентлар учун яна фаол бўлишингиз учун тугмасини <b>«🚕 Йўлдаман»</b> босинг</i>"

    class client:
        choose = "🚖 Такси — <b>Стандарт</b>\n" \
                "<i>Matiz, Nexia 1, Nexia 2, Nexia 3, Spark</i>\n" \
                "💵 5.000 сўм биринчи 500 метр учун\n" \
                "⏱ Бепул кутиш 3 дақиқа\n" \
                "💵 Кейин 2.000 сўм 1 км га\n" \
                "⏱ Кутиш 500 сўм 1 дақиқага\n\n" \
                "🚖 Такси — <b>Комфорт</b>\n" \
                "<i>Cobalt, Gentra, Lacetti, Epica, Malibu, Captiva</i>\n" \
                "💵 7.000 сўм биринчи 500 метр учун\n" \
                "⏱ Бепул кутиш 5 дақиқа\n" \
                "💵 Кейин 2.500 сўм 1 км га\n" \
                "⏱  Кутиш 700 сўм 1 дақиқага"

        delivery = "📦 Доставка\n" \
                   "💵 5.000 сўм биринчи 500 метр учун\n" \
                   "⏱ Бепул кутиш 3 дақиқа\n\n" \
                   "💵 Кейин 2.000 сўм 1 км га\n" \
                   "⏱ Кутиш 500 сўм 1 дақиқага\n\n" \
                   "Машинани қаерга чақиряпсиз?\nМанзилни юборинг👇"

        truck = "Сизга мос келадиган тарифни танланг👇\n\n" \
                  "<b>🚐 Кичкина кузов:</b>\n" \
                  "<i>Labo, Муравейник, Волга, Жигули, Москвич (верхний багаж) ва хоказо</i>\n" \
                  "Вазн — 500 кг гача\nичига — 170 см\nэнига — 100 см\nтепага — 90 см\n\n" \
                  "<b>🚚 Ўртача кузов:</b>\n" \
                  "<i>Kia Bongo 3, Газель, УАЗ бортовой ва хоказо</i>\n" \
                  "Вазн — 1000 кг гача\nичига — 260 см\nэнига — 130 см\nтепага — 150 см\n\n" \
                  "<b>🚛 Катта кузов:</b>\n<i>Isuzu, ЗиЛ, Камаз ва хоказо</i>\n" \
                  "Вазн — 2000 кг гача\nичига — 380 см\nэнига — 180 см\nтепага — 180 см"

        cashback = "Сизда кешбек бор"
        cashback2 = "<i>*ҳар бир муваффақиятли саёҳатдан кейин 5% кешбек берилади</i>"

        location = "Машинани қаерга чақиряпсиз?\nМанзилни юборинг👇"
        comment = "Буюртмага комментария борми? 👇"
        comment_delivery = "Етказиб берувчи нима қилиши керак, комментарияда ёзинг 👇"
        phone = "Рақамингизни жўнатинг 👇\nСиз «Менинг рақамим» тугмасини босишингиз " \
                "ёк рақамингизни шаблонга мувофиқ қўлда киритишингиз мумкин: +998** *** ** ** "
        find = "⏳ Ҳайдовчи қидиряпмиз...\n<i>💬 Ҳайдовчи топилиши билан сиз хабарнома оласиз.</i>"
        accept = "✅ Буюртма қабул қилинади!\nСизнинг олдингизга"
        notFound = "❌ Афсуски, бўш ҳайдовчилар ҳозирги пайтда йўқ, илтимос, 5 дақиқадан сўнг қайта уриниб кўринг👇"
        cancel = "❌ Афсуски, ҳайдовчи буюртмани бекор қилди. Бошқа ҳайдовчи топишингиз мумкин 👇"

        start = "🚙 Саёҳат бошланди... 💵 Йўлкира нархи саёҳат тугагандан сўнг аниқланади."
        finish = "🏁 Саёҳат тугади!"

        class form:
            taxi = "🚖 Такси"
            delivery = "📦 Доставка"
            truck = "🚚 Грузовой"
            standard = "Стандарт"
            comfort = "Комфорт"
            phone = "Сизнинг рақамингиз"
            comment = "Комментария"
            driver = "Ҳайдовчи"

            onWay = "Йўлда"
            waiting = "Пулли кутиш"
            total = "Жами"

    class new_order:
        class new_order:
            new_order = "⚡ Янги буюртма!"
            taxi = "🚖 Такси"
            delivery = "📦 Доставка"
            truck = "🚚 Грузовой"
            standard = "Стандарт"
            comfort = "Комфорт"
            spot = "Ориентир"
            comment = "Комментария"
            order = "Буюртма ва йўловчи маълумотларини олиш учун <b>«✅ Қабул қилиш» тугмасини босинг.</b>"

        class accept:
            accept = "✅ Буюртма қабул қилинди, клиентга хабар бердик"
            client = "🔻 Йўловчи маълумотлари 🔻"
            phone = "Рақами"
            spot = "Ориентир"
            comment = "Комментария"
            location = "📍 Клиентнинг жойлашуви 👇"

        class client:
            accept = "✅ Буюртма қабул қилинади!\nСизнинг олдингизга"
            driver = "Ҳайдовчи"
            phone = "Рақами"
            time = "Тахминий келиш вақти — 5 дақ"

    class start_driver:
        onSpot = "📍 Мен жойимдаман\n" \
                 "💬 Биз мижозни хабардор қилдик\n\n" \
                 "<b>«🚙 Саёҳатни бошлаш»</b> тугмасини босишни унутманг"
        start = "🚙 Саёҳатни бошланди..."
        waiting = "⏱ Кутиш бошланди...\n\n<b>«🚙 Саёҳатни давом этиш»</b> тугмасини босишни унутманг"
        letsGo = "⏱ Кутиш ўчирилди"

        class form:
            finish = "🏁 Саёҳатни тугатиш"
            onWay = "Йўлда"
            paidWaiting = "Пулли кутиш"
            total = "💵 Жами"
            wallet = "Ҳамёнингиз тўлдирилди"
            pay = "Йўловчи кешбек билан тўлаган"
            commission = "*хизмат комиссияси 10%, ҳамёнингиздан ечиб олинади"

        class client:
            arrive = "📍Ҳайдовчи манзилингизга келди👆"
            driver = "Ҳайдовчи"
            driver_phone = "📱 Рақами"
            start = "🚙 Саёҳат бошланди...\n" \
                    "💵 Йўлкира нархи саёҳат тугагандан сўнг аниқланади."
            cashback = "💵 Сизда кешбек бор"
            cashbackNew = "Сизга кешбек берилди"
            pay = "Ушбу кешбек орқали тўлайсизми?"
            cashback2 = "Кешбэк"
            remainder = "Қолгани"
            total = "💵 Жами"

    class active_order:
        taxi = "🚖 Такси"
        standard = "Стандарт"
        comfort = "Комфорт"
        delivery = "📦 Доставка"
        status = "Ҳолат"
        waiting = "Ҳайдовчи қидирилмоқда"
        accept = "Ариза қабул қилинди"
        client_phone = "Рақамингиз"
        comment = "Комментария"
        noOrder = "Сизда ҳозирда фаол буюртмалар йўқ."
        cancel = "Буюртмани бекор қилмоқчимисиз? Бу ҳаракатни қайтариб бўлмайди."
        delete = "Бекор қилинди."
        delete_driver = "❌ Афсуски, йуловчи заказни тарк этди\n🔎 Сиз учун бошқа заказ қидиряпмиз..."
        delete_client = "❌ Афсуски ҳайдовчи заказни тарк этди"
        driver = "Ҳайдовчи"
        driver_phone = "📱 Рақами"

    class alert:
        class driver:
            emptySpots = "Белгиларни танланг"
            nonFormat = "Нотўғри формат, қайта киритинг 👇"
            order = "Ариза бошқа ҳайдовчи томонидан қабул қилинган"
            orderDistance = "⛔️ Йуловчининг мижознинг жойлашувидан узоқдасиз"
            notEnoughMoney = "⚠ Ҳамёнингизда етарли маблағ йўқ. 💳 Йўналишга қайтиш ва мижозлардан " \
                             "буюртма олиш учун ҳамёнингизни тўлдиринг!"
            onlyTruck = "Сизда юк машина, сиз фақат 🚚 Грузовойни танласайиз бўлади"
            onlyNoTruck = "Сизда юк машина эмас, 🚚 Грузовойни танлаш мумкин эмас"
            cashbackTime = "Ариза мавжуд эмас"

