models = [
    ('Cobalt', 'taxi', 'comfort'),
    ('Gentra', 'taxi', 'comfort'),
    ('Lacetti', 'taxi', 'comfort'),
    ('Nexia 1', 'taxi', 'standard'),
    ('Nexia 2', 'taxi', 'standard'),
    ('Nexia 3', 'taxi', 'standard'),
    ('Malibu 1', 'taxi', 'comfort'),
    ('Captiva', 'taxi', 'comfort'),
    ('Malibu 2', 'taxi', 'comfort'),
    ('Matiz', 'taxi', 'standard'),
    ('Spark', 'taxi', 'standard'),
    ('Epica', 'taxi', 'comfort'),
    ('Lada', 'taxi', 'standard'),
    ('Иномарка', 'taxi', 'comfort'),

    ('Labo', 'truck', 'small'),
    ('Муравейник', 'truck', 'small'),
    ('Волга', 'truck', 'small'),
    ('Жигули', 'truck', 'small'),
    ('Москвич', 'truck', 'small'),
    ('Другое', 'truck', 'small'),


    ('KIA Bongo 3', 'truck', 'medium'),
    ('Газель', 'truck', 'medium'),
    ('УАЗ бортовой', 'truck', 'medium'),
    ('Другое', 'truck', 'medium'),

    ('Isuzu', 'truck', 'big'),
    ('ЗиЛ', 'truck', 'big'),
    ('Камаз', 'truck', 'big'),
    ('Другое', 'truck', 'big'),

]

car_subtype = [
    ('taxi', 'standard', '🚕 Стандарт', '🚕 Стандарт', '🚕 Стандарт', 500, 2000, 5000, 0.5, 3),
    ('taxi', 'comfort', '🚙 Комфорт', '🚙 Комфорт', '🚙 Комфорт', 500, 2500, 7000, 0.5, 5),


    ('truck', 'small', '🚐 Маленький кузов', '🚐 Маленький кузов', '🚐 Маленький кузов', 1000, 5000, 10000, 1, 15),
    ('truck', 'medium', '🚚 Средний кузов', '🚚 Средний кузов', '🚚 Средний кузов', 1000, 6000, 12000, 1, 15),
    ('truck', 'big', '🚛 Большой кузов', '🚛 Большой кузов', '🚛 Большой кузов', 1000, 7000, 15000, 1, 15),

    ('delivery', 'delivery', '📦 Доставка', '📦 Доставка', '📦 Доставка', 500, 2000, 5000, 0.5, 3),
]


colors = [
    ('Белый', 'Белый', 'Белый'),
    ('Черный', 'Черный', 'Черный'),
    ('Серебристый', 'Серебристый', 'Серебристый'),
    ('Темно-серый', 'Темно-серый', 'Темно-серый'),
    ('Молочный', 'Молочный', 'Молочный'),
    ('Вишневый', 'Вишневый', 'Вишневый'),
    ('Желтый', 'Желтый', 'Желтый'),
    ('Красный', 'Красный', 'Красный'),
    ('Зеленый', 'Зеленый', 'Зеленый'),
    ('Синий', 'Синий', 'Синий'),
    ('Голубой', 'Голубой', 'Голубой'),
]
tariffs = [

    (25000, None, '🟡 Минимальный', '🟡 Минимальный', '🟡 Минимальный', 3),
    (50000, 58000, '🟢 Стандартный', '🟢 Стандартный', '🟢 Стандартный', 7),
    (140000, 250000, '🔵 Выгодный', '🔵 Выгодный', '🔵 Выгодный', 30),
]
spots = [
    ({"latitude": 38.81125, "longitude": 65.774853}, "АЭРОПОРТ", "АЭРОПОРТ", "АЭРОПОРТ"),

    ({"latitude": 38.841743, "longitude": 65.801451}, "3-МКР", "3-МКР", "3-МКР"),
    ({"latitude": 38.83377, "longitude": 65.788563}, "4-5-6 МКР", "4-5-6 МКР", "4-5-6 МКР"),
    ({"latitude": 38.833833, "longitude": 65.780674}, "7-МКР", "7-МКР", "7-МКР"),

    ({"latitude": 38.827637, "longitude": 65.81162}, "8-МКР", "8-МКР", "8-МКР"),
    ({"latitude": 38.876198, "longitude": 65.80282}, "АНХОР", "АНХОР", "АНХОР"),
    ({"latitude": 38.838299, "longitude": 65.829776}, "АРОЛОВУЛ", "АРОЛОВУЛ", "АРОЛОВУЛ"),

    ({"latitude": 38.84465, "longitude": 65.781843}, "ГЕОЛОГ", "ГЕОЛОГ", "ГЕОЛОГ"),
    ({"latitude": 38.855866, "longitude": 65.79884}, "ГОР ГАЗ", "ГОР ГАЗ", "ГОР ГАЗ"),
    ({"latitude": 38.849963, "longitude": 65.821115}, "ЖАЙХУН", "ЖАЙХУН", "ЖАЙХУН"),

    ({"latitude": 38.823058, "longitude": 65.780733}, "ВОКЗАЛ", "ВОКЗАЛ", "ВОКЗАЛ"),
    ({"latitude": 38.860714, "longitude": 65.779826}, "ГЕЗ", "ГЕЗ", "ГЕЗ"),
    ({"latitude": 38.860732, "longitude": 65.763598}, "КАМАНДИ", "КАМАНДИ", "КАМАНДИ"),


    ({"latitude": 38.849476, "longitude": 65.839103}, "ДЕТСКАЯ БОЛЬНИЦА", "ДЕТСКАЯ БОЛЬНИЦА", "ДЕТСКАЯ БОЛЬНИЦА"),
    ({"latitude": 38.850972, "longitude": 65.811459}, "ЁГДУ ЧОЙХОНА", "ЁГДУ ЧОЙХОНА", "ЁГДУ ЧОЙХОНА"),

    ({"latitude": 38.865524, "longitude": 65.818088}, "КАРШИ ЧОЙХОНА", "КАРШИ ЧОЙХОНА", "КАРШИ ЧОЙХОНА"),
    ({"latitude": 38.873499, "longitude": 65.777699}, "КИЗИЛ МАЧИТ", "КИЗИЛ МАЧИТ", "КИЗИЛ МАЧИТ"),

    ({"latitude": 38.816815, "longitude": 65.786839}, "МАСЛО ЗАВОД", "МАСЛО ЗАВОД", "МАСЛО ЗАВОД"),
    ({"latitude": 38.809699, "longitude": 65.810767}, "МАШИНА БОЗОР", "МАШИНА БОЗОР", "МАШИНА БОЗОР"),

    ({"latitude": 38.860577, "longitude": 65.836494}, "КАМСАМОЛ", "КАМСАМОЛ", "КАМСАМОЛ"),
    ({"latitude": 38.877756, "longitude": 65.814664}, "МУЖИЗА", "МУЖИЗА", "МУЖИЗА"),
    ({"latitude": 38.834093, "longitude": 65.800828}, "ПАХТАЗОР", "ПАХТАЗОР", "ПАХТАЗОР"),

    ({"latitude": 38.829884, "longitude": 65.795279}, "ОРЗУ БАЗАР", "ОРЗУ БАЗАР", "ОРЗУ БАЗАР"),
    ({"latitude": 38.845671, "longitude": 65.768203}, "МЕХАНИЗАТОР", "МЕХАНИЗАТОР", "МЕХАНИЗАТОР"),

    ({"latitude": 38.888673, "longitude": 65.809147}, "СОХИЛ", "СОХИЛ", "СОХИЛ"),
    ({"latitude": 38.829015, "longitude": 65.746568}, "СПУТНИК", "СПУТНИК", "СПУТНИК"),
    ({"latitude": 38.903862, "longitude": 65.789631}, "УЗУН НАВО", "УЗУН НАВО", "УЗУН НАВО"),

    ({"latitude": 38.870585, "longitude": 65.800643}, "ЭСКИ Ш. ПАСИ", "ЭСКИ Ш. ПАСИ", "ЭСКИ Ш. ПАСИ"),
    ({"latitude": 38.869335, "longitude": 65.802992}, "ЭСКИ Ш. ТЕПА", "ЭСКИ Ш. ТЕПА", "ЭСКИ Ш. ТЕПА"),

    ({"latitude": 38.851231, "longitude": 65.792283}, "ЦУМ", "ЦУМ", "ЦУМ"),
    ({"latitude": 38.851663, "longitude": 65.788434}, "ЯНГИ БОЗОР", "ЯНГИ БОЗОР", "ЯНГИ БОЗОР"),


]
